{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "279d86a4-324a-4229-aeb2-185264df05d7",
   "metadata": {},
   "source": [
    "## Neo4j Code to load data, nodes, properties and relationships\n",
    "\n",
    "This file is used to import data into neo4j graph data base and execute queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5367cf61-714a-4c9b-80da-ba5e1bc4ab07",
   "metadata": {},
   "source": [
    "## 1- Install neo4j Desktop\n",
    "\n",
    "Here are the steps to install and setup neo4j in an ubuntu laptop.\n",
    "Similar instructions are available for macOS, windows, and other Linux OS\n",
    "\n",
    "### --------------neo4j instructions------------------\n",
    "***Neo4j desktop is most likely all that is needed for the system to operate, but these are the steps used in the test system.***\n",
    "\n",
    "### [ ] how to install neo4j desktop on ubuntu:\n",
    "\n",
    "First install fuse (pick the steps that work for your version of ubuntu)\n",
    "\n",
    "https://github.com/AppImage/AppImageKit/wiki/FUSE\n",
    "\n",
    "\n",
    "for ubuntu 22.04 or greater type in terminal:\n",
    "\n",
    "sudo add-apt-repository universe\n",
    "\n",
    "sudo apt install libfuse2\n",
    "\n",
    "\n",
    "Download appimage from https://neo4j.com/download/\n",
    "\n",
    "\n",
    "in terminal type in the folder where the file was downloaded (note might need to change the file version number):\n",
    "\n",
    "chmod a+x neo4j-desktop-1.0.3-x86_64.AppImage; \n",
    "\n",
    "./neo4j-desktop-1.0.3-x86_64.AppImage\n",
    "\n",
    "\n",
    "\n",
    "### -------------------------neo4j configuration/file paths------------------\n",
    "\n",
    "once neo4j is installed\n",
    "\n",
    "run neo4j desktop by typing the following in a terminal:\n",
    "\n",
    "\n",
    "XXXXXXX\n",
    "\n",
    "\n",
    "neo4j desktop may open as part of the installation. \n",
    "\n",
    "Keep track of the following information.\n",
    "\n",
    "The following settings will need to be entered in the neo4j_graph_etl notebook\n",
    "\n",
    "\n",
    "bolt: 7687 → 7689\n",
    "\n",
    "http: 7474 → 7475\n",
    "\n",
    "\n",
    "also keep track of\n",
    "\n",
    "\n",
    "username: neo4j\n",
    "\n",
    "password: XXXXX\n",
    "\n",
    "\n",
    "They will also need to be entered in the notebook\n",
    "\n",
    "\n",
    "In the neo4j desktop app from the \"home\" or \"startup\" screen under example projects, click add then click local dbms.\n",
    "\n",
    "Enter the name of the server (ex: SBIR)\n",
    "\n",
    "\n",
    "A new server with that name will show up under example project. click on the three dots to the right of the server name.\n",
    "\n",
    "Click open folder then click import. a new window will open up showing the contents of the import folder.\n",
    "\n",
    "The path to that folder should be listed at the top of the screen. Copy or write down that path and save it. \n",
    "\n",
    "This path is needed to import csv files into neo4j, the neo4j notebook will need to know the path to the neo4j import folder\n",
    "\n",
    "\n",
    "ex: /home/laben/.config/Neo4j Desktop/Application/relate-data/dbmss/dbms-6959f6d4-5ba3-45e0-a8db-7a248c595605/import\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "442bcdc9-2a71-4ad7-9442-18d527d6c6ef",
   "metadata": {},
   "source": [
    "## 2 - Set Variables\n",
    "\n",
    "After completing the neo4j installation, update the variables in the notebook to reference the specific values for the system the notebook is running on.\n",
    "\n",
    "## 3 - Load in base level csv files and flatten them for import into neo4j\n",
    "\n",
    "Create additional csv files after flattening some of the cells in the original csv files.\n",
    "\n",
    "## 4 - Copy Data files to neo4j data directory\n",
    "\n",
    "Import the csv files from the input file directory into the neo4j import directory.\n",
    "\n",
    "## 5 - Create nodes and edges in neo4j\n",
    "\n",
    "Run Cypher queries to create nodes and edges\n",
    "\n",
    "## 6 - Test Queries (Optional)\n",
    "\n",
    "Run some test queries to verify data is correctly setup in neo4j\n",
    "\n",
    "## 7 - Conduct Queries to answer questions posed for Final Project\n",
    "\n",
    "These are the queries proposed the team would answer for the DSE 203 Final Project"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f5913c98-c27e-4e0d-a4d9-2a3e9e2682ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "## install \n",
    "#pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6c392867-d582-4a96-b523-5dd678360d18",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2023-12-09 07:37:22.370998: I tensorflow/core/util/port.cc:113] oneDNN custom operations are on. You may see slightly different numerical results due to floating-point round-off errors from different computation orders. To turn them off, set the environment variable `TF_ENABLE_ONEDNN_OPTS=0`.\n",
      "2023-12-09 07:37:22.372544: I external/local_tsl/tsl/cuda/cudart_stub.cc:31] Could not find cuda drivers on your machine, GPU will not be used.\n",
      "2023-12-09 07:37:22.393781: E external/local_xla/xla/stream_executor/cuda/cuda_dnn.cc:9261] Unable to register cuDNN factory: Attempting to register factory for plugin cuDNN when one has already been registered\n",
      "2023-12-09 07:37:22.393798: E external/local_xla/xla/stream_executor/cuda/cuda_fft.cc:607] Unable to register cuFFT factory: Attempting to register factory for plugin cuFFT when one has already been registered\n",
      "2023-12-09 07:37:22.394381: E external/local_xla/xla/stream_executor/cuda/cuda_blas.cc:1515] Unable to register cuBLAS factory: Attempting to register factory for plugin cuBLAS when one has already been registered\n",
      "2023-12-09 07:37:22.398511: I tensorflow/core/platform/cpu_feature_guard.cc:182] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.\n",
      "To enable the following instructions: AVX2 AVX512F AVX512_VNNI FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.\n",
      "2023-12-09 07:37:22.899593: W tensorflow/compiler/tf2tensorrt/utils/py_utils.cc:38] TF-TRT Warning: Could not find TensorRT\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "from pandas import json_normalize\n",
    "import ast\n",
    "from ast import literal_eval\n",
    "from py2neo import Graph\n",
    "import spacy\n",
    "import subprocess"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6589f220-3f71-4304-9836-8422c6c30f2e",
   "metadata": {},
   "source": [
    "## 2 - Set Variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "a571d472-01e4-4492-91b4-ba07bcce3922",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set variables to each specific user/machine that is running the notebook\n",
    "\n",
    "#Username will be used to switch to different users settings as configured in this file\n",
    "#neo4j_import_dir = \"/Users/prakhar/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-c1b4f9c3-baa6-45d6-a13c-31ec4ba4c393/import\" #SF\n",
    "neo4j_import_dir = \"/home/laben/.config/Neo4j Desktop/Application/relate-data/dbmss/dbms-6959f6d4-5ba3-45e0-a8db-7a248c595605/import\" #LF\n",
    "#neo4j_import_dir = \"/Users/sagarjogadhenu/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-f6ef41f5-ff23-4598-9ef0-df4c332f4744/import\" #SJ\n",
    "\n",
    "#neo4j connection settings\n",
    "neo4j_url = \"bolt://localhost:7689\" #LF\n",
    "#neo4j_url = \"bolt://localhost:7690\" #PS\n",
    "#neo4j_url = \"bolt://localhost:7687\" #SJ\n",
    "neo4j_username = \"neo4j\"\n",
    "neo4j_password = \"Welcome19\" #LF\n",
    "#neo4j_password = \"Welcome19#\" #PS\n",
    "#neo4j_password = \"dse203sbir\" #SJ\n",
    "\n",
    "# Filenames of the data sets needed to be loaded into neo4j and modified\n",
    "# These files will create additional csv files.\n",
    "# The acutal csv files loaded into neo4j will be defined in step 3\n",
    "filename_sbir = './preprocessed_files/sbir_1k_sample.csv'\n",
    "filename_patents = './preprocessed_files/patents.json'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6dfd8014-2111-4f8e-b9eb-92f5bde1fa4c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to your Neo4j database\n",
    "graph = Graph(neo4j_url, auth=(neo4j_username, neo4j_password))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ea11abec-adf7-44b7-9250-118507084ae2",
   "metadata": {},
   "source": [
    "## 3 - load in base level csv files and flatten them for import into neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bbf4c179-1397-4521-aade-3e12896e9020",
   "metadata": {},
   "source": [
    "### Load the SBIR sample data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "26fda4e3-a8b0-4fa5-a436-87389e1ef8b5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>Company</th>\n",
       "      <th>Award Title</th>\n",
       "      <th>Agency</th>\n",
       "      <th>Branch</th>\n",
       "      <th>Phase</th>\n",
       "      <th>Program</th>\n",
       "      <th>Agency Tracking Number</th>\n",
       "      <th>Contract</th>\n",
       "      <th>Proposal Award Date</th>\n",
       "      <th>...</th>\n",
       "      <th>Contact Email</th>\n",
       "      <th>PI Name</th>\n",
       "      <th>PI Title</th>\n",
       "      <th>PI Phone</th>\n",
       "      <th>PI Email</th>\n",
       "      <th>RI Name</th>\n",
       "      <th>RI POC Name</th>\n",
       "      <th>RI POC Phone</th>\n",
       "      <th>abstract_entities</th>\n",
       "      <th>key</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>16068</td>\n",
       "      <td>EXPEDITION TECHNOLOGY, INC.</td>\n",
       "      <td>Fast Recovery Of Signal Estimates using Neural...</td>\n",
       "      <td>Department of Defense</td>\n",
       "      <td>Navy</td>\n",
       "      <td>Phase I</td>\n",
       "      <td>SBIR</td>\n",
       "      <td>N192-128-0403</td>\n",
       "      <td>N68335-19-C-0742</td>\n",
       "      <td>10/21/2019</td>\n",
       "      <td>...</td>\n",
       "      <td>marc.harlacher@exptechinc.com</td>\n",
       "      <td>Mike Tinston</td>\n",
       "      <td>Chief Scientist</td>\n",
       "      <td>(571) 246-8479</td>\n",
       "      <td>mike.tinston@exptechinc.com</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['condition', 'signal density', 'signal mingle...</td>\n",
       "      <td>16068</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>187914</td>\n",
       "      <td>Apa Optics, Inc.</td>\n",
       "      <td>EXTRAVEHICULAR MOBILITY UNIT HELMET MOUNTED DI...</td>\n",
       "      <td>National Aeronautics and Space Administration</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Phase II</td>\n",
       "      <td>SBIR</td>\n",
       "      <td>6818</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>David E Stoltzmann</td>\n",
       "      <td>NaN</td>\n",
       "      <td>() -</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['OPTICAL MECHANICAL DESIGNS', 'opto-mechanica...</td>\n",
       "      <td>187914</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>97687</td>\n",
       "      <td>RADIATION MONITORING DEVICES, INC.</td>\n",
       "      <td>An Efficient, Solid State Detector for Nuclear...</td>\n",
       "      <td>Department of Energy</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Phase II</td>\n",
       "      <td>SBIR</td>\n",
       "      <td>80498S06-I</td>\n",
       "      <td>DE-FG02-06ER84430</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>GEntine@rmdinc.com</td>\n",
       "      <td>Michael Squillante</td>\n",
       "      <td>Dr</td>\n",
       "      <td>(617) 668-6808</td>\n",
       "      <td>MSquillante@rmdinc.com</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['signal-to-noise ratio', 'Computed tomography...</td>\n",
       "      <td>97687</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>38328</td>\n",
       "      <td>QUASAR FEDERAL SYSTEMS, INC.</td>\n",
       "      <td>Miniature Oriented Tri-Axial Fluxgate Magnetom...</td>\n",
       "      <td>Department of Defense</td>\n",
       "      <td>Navy</td>\n",
       "      <td>Phase I</td>\n",
       "      <td>SBIR</td>\n",
       "      <td>N172-116-0564</td>\n",
       "      <td>N68335-17-C-0621</td>\n",
       "      <td>08/30/2017</td>\n",
       "      <td>...</td>\n",
       "      <td>twrightson@quasarfs.com</td>\n",
       "      <td>Yongming Zhang</td>\n",
       "      <td>CEO</td>\n",
       "      <td>(858) 412-1737</td>\n",
       "      <td>yongming@quasarfs.com</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['long range sigint', 'magnetic signature', 'e...</td>\n",
       "      <td>38328</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>82571</td>\n",
       "      <td>INVOTEK, INC.</td>\n",
       "      <td>Prosody enhanced TTS for Dysarthric Speakers</td>\n",
       "      <td>Department of Health and Human Services</td>\n",
       "      <td>National Institutes of Health</td>\n",
       "      <td>Phase I</td>\n",
       "      <td>SBIR</td>\n",
       "      <td>DC010085</td>\n",
       "      <td>1R43DC010085-01</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>tjakobs@invotek.org</td>\n",
       "      <td>THOMAS JAKOBS</td>\n",
       "      <td>NaN</td>\n",
       "      <td>(479) 632-4166</td>\n",
       "      <td>TJAKOBS@INVOTEK.ORG</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>['feasibility project', 'control prosody compu...</td>\n",
       "      <td>82571</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 44 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       id                             Company  \\\n",
       "0   16068         EXPEDITION TECHNOLOGY, INC.   \n",
       "1  187914                    Apa Optics, Inc.   \n",
       "2   97687  RADIATION MONITORING DEVICES, INC.   \n",
       "3   38328        QUASAR FEDERAL SYSTEMS, INC.   \n",
       "4   82571                       INVOTEK, INC.   \n",
       "\n",
       "                                         Award Title  \\\n",
       "0  Fast Recovery Of Signal Estimates using Neural...   \n",
       "1  EXTRAVEHICULAR MOBILITY UNIT HELMET MOUNTED DI...   \n",
       "2  An Efficient, Solid State Detector for Nuclear...   \n",
       "3  Miniature Oriented Tri-Axial Fluxgate Magnetom...   \n",
       "4       Prosody enhanced TTS for Dysarthric Speakers   \n",
       "\n",
       "                                          Agency  \\\n",
       "0                          Department of Defense   \n",
       "1  National Aeronautics and Space Administration   \n",
       "2                           Department of Energy   \n",
       "3                          Department of Defense   \n",
       "4        Department of Health and Human Services   \n",
       "\n",
       "                          Branch     Phase Program Agency Tracking Number  \\\n",
       "0                           Navy   Phase I    SBIR          N192-128-0403   \n",
       "1                            NaN  Phase II    SBIR                   6818   \n",
       "2                            NaN  Phase II    SBIR             80498S06-I   \n",
       "3                           Navy   Phase I    SBIR          N172-116-0564   \n",
       "4  National Institutes of Health   Phase I    SBIR               DC010085   \n",
       "\n",
       "            Contract Proposal Award Date  ...                  Contact Email  \\\n",
       "0   N68335-19-C-0742          10/21/2019  ...  marc.harlacher@exptechinc.com   \n",
       "1                NaN                 NaN  ...                            NaN   \n",
       "2  DE-FG02-06ER84430                 NaN  ...             GEntine@rmdinc.com   \n",
       "3   N68335-17-C-0621          08/30/2017  ...        twrightson@quasarfs.com   \n",
       "4    1R43DC010085-01                 NaN  ...            tjakobs@invotek.org   \n",
       "\n",
       "               PI Name         PI Title        PI Phone  \\\n",
       "0         Mike Tinston  Chief Scientist  (571) 246-8479   \n",
       "1  David E Stoltzmann               NaN            () -   \n",
       "2   Michael Squillante               Dr  (617) 668-6808   \n",
       "3       Yongming Zhang              CEO  (858) 412-1737   \n",
       "4        THOMAS JAKOBS              NaN  (479) 632-4166   \n",
       "\n",
       "                      PI Email RI Name RI POC Name  RI POC Phone  \\\n",
       "0  mike.tinston@exptechinc.com     NaN         NaN           NaN   \n",
       "1                          NaN     NaN         NaN           NaN   \n",
       "2       MSquillante@rmdinc.com     NaN         NaN           NaN   \n",
       "3        yongming@quasarfs.com     NaN         NaN           NaN   \n",
       "4          TJAKOBS@INVOTEK.ORG     NaN         NaN           NaN   \n",
       "\n",
       "                                   abstract_entities     key  \n",
       "0  ['condition', 'signal density', 'signal mingle...   16068  \n",
       "1  ['OPTICAL MECHANICAL DESIGNS', 'opto-mechanica...  187914  \n",
       "2  ['signal-to-noise ratio', 'Computed tomography...   97687  \n",
       "3  ['long range sigint', 'magnetic signature', 'e...   38328  \n",
       "4  ['feasibility project', 'control prosody compu...   82571  \n",
       "\n",
       "[5 rows x 44 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Read the Excel file into a pandas DataFrame\n",
    "df_sbir = pd.read_csv(filename_sbir)\n",
    "#df_sbir.rename(columns={'Agency Tracking Number': 'id_Agency Tracking Number'}, inplace=True)\n",
    "\n",
    "df_sbir['Award Amount'] = pd.to_numeric(df_sbir['Award Amount'].str.replace(',', ''), errors='coerce')\n",
    "\n",
    "\n",
    "df_sbir['key'] = df_sbir.id # PS Change 12/08 12 PM\n",
    "df_sbir.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e5155a71-b6ee-4f2b-8383-0a20cfac3da9",
   "metadata": {},
   "outputs": [],
   "source": [
    "selected_columns1 = ['key',\n",
    "                     'Agency Tracking Number', 'Company', 'Branch', 'Award Title', 'Agency', 'Company Website', 'Contract', 'Proposal Award Date', 'Contract End Date', 'Solicitation Number', 'Solicitation Year',\n",
    "                     'Solicitation Close Date', 'Proposal Receipt Date', 'Date of Notification', 'Topic Code', 'Award Year', 'Award Amount',\n",
    "                     'PI Name', 'PI Title', 'PI Phone', 'PI Email', 'RI Name', 'RI POC Name', 'RI POC Phone','Address1','Address2', 'City', 'State', 'Zip',\n",
    "                     'HUBZone Owned', 'Socially and Economically Disadvantaged','Women Owned'\n",
    "                    ]\n",
    "\n",
    "selected_columns2 = ['key','Abstract','abstract_entities']   ##need to remove/update  #PS update 12/08/1:45 PM\n",
    "# Remove leading/trailing whitespaces\n",
    "selected_columns1 = [col.strip() for col in selected_columns1]\n",
    "selected_columns2 = [col.strip() for col in selected_columns2]\n",
    "\n",
    "df_sbirs = df_sbir[selected_columns1]\n",
    "\n",
    "df_sbirent = df_sbir[selected_columns2]\n",
    "\n",
    "\n",
    "df_sbirs.to_csv('./preprocessed_files/neo4j_sbir_main.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f49442d9-9781-4765-9e9e-7fc8e06a2978",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>key</th>\n",
       "      <th>Abstract</th>\n",
       "      <th>abstract_entities</th>\n",
       "      <th>entities</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>16068</td>\n",
       "      <td>Current automated RF signal acquisition and an...</td>\n",
       "      <td>['condition', 'signal density', 'signal mingle...</td>\n",
       "      <td>condition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>16068</td>\n",
       "      <td>Current automated RF signal acquisition and an...</td>\n",
       "      <td>['condition', 'signal density', 'signal mingle...</td>\n",
       "      <td>signal density</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>16068</td>\n",
       "      <td>Current automated RF signal acquisition and an...</td>\n",
       "      <td>['condition', 'signal density', 'signal mingle...</td>\n",
       "      <td>signal mingle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>16068</td>\n",
       "      <td>Current automated RF signal acquisition and an...</td>\n",
       "      <td>['condition', 'signal density', 'signal mingle...</td>\n",
       "      <td>signal intermodulation product desire</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>16068</td>\n",
       "      <td>Current automated RF signal acquisition and an...</td>\n",
       "      <td>['condition', 'signal density', 'signal mingle...</td>\n",
       "      <td>Bandwidth ( ibw ) receiver wide bit-depth reduce</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20899</th>\n",
       "      <td>171725</td>\n",
       "      <td>We propose to provide a set of general design ...</td>\n",
       "      <td>['system configuration', 'central distribution...</td>\n",
       "      <td>expert design engineering</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20900</th>\n",
       "      <td>171725</td>\n",
       "      <td>We propose to provide a set of general design ...</td>\n",
       "      <td>['system configuration', 'central distribution...</td>\n",
       "      <td>sample transfer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20901</th>\n",
       "      <td>171725</td>\n",
       "      <td>We propose to provide a set of general design ...</td>\n",
       "      <td>['system configuration', 'central distribution...</td>\n",
       "      <td>efficiency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20902</th>\n",
       "      <td>171725</td>\n",
       "      <td>We propose to provide a set of general design ...</td>\n",
       "      <td>['system configuration', 'central distribution...</td>\n",
       "      <td>integration</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20903</th>\n",
       "      <td>171725</td>\n",
       "      <td>We propose to provide a set of general design ...</td>\n",
       "      <td>['system configuration', 'central distribution...</td>\n",
       "      <td>mechanical design</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>20904 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          key                                           Abstract  \\\n",
       "0       16068  Current automated RF signal acquisition and an...   \n",
       "1       16068  Current automated RF signal acquisition and an...   \n",
       "2       16068  Current automated RF signal acquisition and an...   \n",
       "3       16068  Current automated RF signal acquisition and an...   \n",
       "4       16068  Current automated RF signal acquisition and an...   \n",
       "...       ...                                                ...   \n",
       "20899  171725  We propose to provide a set of general design ...   \n",
       "20900  171725  We propose to provide a set of general design ...   \n",
       "20901  171725  We propose to provide a set of general design ...   \n",
       "20902  171725  We propose to provide a set of general design ...   \n",
       "20903  171725  We propose to provide a set of general design ...   \n",
       "\n",
       "                                       abstract_entities  \\\n",
       "0      ['condition', 'signal density', 'signal mingle...   \n",
       "1      ['condition', 'signal density', 'signal mingle...   \n",
       "2      ['condition', 'signal density', 'signal mingle...   \n",
       "3      ['condition', 'signal density', 'signal mingle...   \n",
       "4      ['condition', 'signal density', 'signal mingle...   \n",
       "...                                                  ...   \n",
       "20899  ['system configuration', 'central distribution...   \n",
       "20900  ['system configuration', 'central distribution...   \n",
       "20901  ['system configuration', 'central distribution...   \n",
       "20902  ['system configuration', 'central distribution...   \n",
       "20903  ['system configuration', 'central distribution...   \n",
       "\n",
       "                                               entities  \n",
       "0                                             condition  \n",
       "1                                        signal density  \n",
       "2                                         signal mingle  \n",
       "3                 signal intermodulation product desire  \n",
       "4      Bandwidth ( ibw ) receiver wide bit-depth reduce  \n",
       "...                                                 ...  \n",
       "20899                         expert design engineering  \n",
       "20900                                   sample transfer  \n",
       "20901                                        efficiency  \n",
       "20902                                       integration  \n",
       "20903                                 mechanical design  \n",
       "\n",
       "[20904 rows x 4 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "#Explode the 'abstract_entities' column  (need to update)\n",
    "#This is done so that the list of entities are converted to individual entites\n",
    "#that can be placed into seperate rows in a csv file which will be importated to neo4j\n",
    "#df_source_sbir = df_sbirent\n",
    "\n",
    "df_entities_sbir = pd.DataFrame(columns=['key','entities'])\n",
    "#df_sbirent['abstract_entities']\n",
    "#df_exploded_sbir = df_sbirent.explode('abstract_entities')\n",
    "#df_exploded_sbir = df_source_sbir\n",
    "#Display the resulting DataFrame\n",
    "#display(df_sbirent)\n",
    "#display(df_sbirent['abstract_entities'].iloc[0])\n",
    "#test = df_sbirent['abstract_entities'].iloc[0].replace(''','').replace('[','').replace(']','').split(',')\n",
    "#print(test)\n",
    "#print(len(test))\n",
    "\n",
    "for i in range(0, len(df_sbirent)):\n",
    "    temp_list = df_sbirent['abstract_entities'].iloc[i].replace('\\'','').replace('[','').replace(']','').split(',')\n",
    "\n",
    "    for x in range(0, len(temp_list)):\n",
    "        #print(temp_list[x])\n",
    "        df_entities_sbir.loc[len(df_entities_sbir.index)] = [df_sbirent['key'].iloc[i], temp_list[x].strip()]\n",
    "        #df_sbirent.loc[len(df_entities_sbir.index)] = [df_sbirent['key'].iloc[i], temp_list[x]]\n",
    "\n",
    "df_sbir_abstract_entities = pd.merge(df_sbirent, df_entities_sbir, on='key', how='inner') \n",
    "display(df_sbir_abstract_entities)\n",
    "df_sbir_abstract_entities.to_csv('./preprocessed_files/neo4j_sbir_abstract_entities.csv', index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "146fc0d5-ce19-4638-8448-31d07f6b1f83",
   "metadata": {},
   "source": [
    "### Load the Patent sample data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ed271fea-84a7-4e06-8b57-6c57d9ea695f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>country</th>\n",
       "      <th>doc-number</th>\n",
       "      <th>date</th>\n",
       "      <th>application-reference</th>\n",
       "      <th>title</th>\n",
       "      <th>assignee</th>\n",
       "      <th>inventors</th>\n",
       "      <th>abstract</th>\n",
       "      <th>claims</th>\n",
       "      <th>abstract_entities</th>\n",
       "      <th>claim_entities</th>\n",
       "      <th>key</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>US</td>\n",
       "      <td>20230227158</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18123405, 'dat...</td>\n",
       "      <td>UNMANNED AERIAL SYSTEM AND METHOD FOR CONTACT ...</td>\n",
       "      <td>{'orgname': 'Beirobotics LLC', 'city': 'Richmo...</td>\n",
       "      <td>[{'last-name': 'Beiro', 'first-name': 'Michael...</td>\n",
       "      <td>\\nA system for performing work on electrical p...</td>\n",
       "      <td>a power line tool adapted to perch on an energ...</td>\n",
       "      <td>[splice electrical power line, power line tool...</td>\n",
       "      <td>[power line tool, method, couple unmanned, sla...</td>\n",
       "      <td>20230227158</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>US</td>\n",
       "      <td>20230229051</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 17577538, 'dat...</td>\n",
       "      <td>METHOD AND DEVICE FOR CONTROLLING STATES OF DY...</td>\n",
       "      <td>{'orgname': 'FURCIFER INC.', 'city': 'FREMONT'...</td>\n",
       "      <td>[{'last-name': 'WANG', 'first-name': 'JIAN', '...</td>\n",
       "      <td>\\nThe disclosure relates generally to a method...</td>\n",
       "      <td>selecting a desired optical state of the elect...</td>\n",
       "      <td>[method, optical state base, switch, power, di...</td>\n",
       "      <td>[controller, optical state base, switch, signa...</td>\n",
       "      <td>20230229051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>US</td>\n",
       "      <td>20230229087</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18098167, 'dat...</td>\n",
       "      <td>UV-CURABLE QUANTUM DOT FORMULATIONS</td>\n",
       "      <td>{'orgname': 'Nanosys, Inc.', 'city': 'Milpitas...</td>\n",
       "      <td>[{'last-name': 'IPPEN', 'first-name': 'Christi...</td>\n",
       "      <td>\\nProvided are patterned films comprising nano...</td>\n",
       "      <td>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n</td>\n",
       "      <td>[electroluminescent device, method pattern, uv...</td>\n",
       "      <td>[]</td>\n",
       "      <td>20230229087</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>US</td>\n",
       "      <td>20230230714</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18010358, 'dat...</td>\n",
       "      <td>CONTROL DRUM CONTROLLER FOR NUCLEAR REACTOR SY...</td>\n",
       "      <td>{'orgname': 'Ultra Safe Nuclear Corporation', ...</td>\n",
       "      <td>[{'last-name': 'Chaleff', 'first-name': 'Ethan...</td>\n",
       "      <td>\\nA nuclear reactor system includes a nuclear ...</td>\n",
       "      <td>a pressure vessel;\\na nuclear reactor core dis...</td>\n",
       "      <td>[moderator element, nuclear reactor core dispo...</td>\n",
       "      <td>[internal control drum, longitudinally pressur...</td>\n",
       "      <td>20230230714</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>US</td>\n",
       "      <td>20230230802</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18178664, 'dat...</td>\n",
       "      <td>Ultra High Purity Conditions for Atomic Scale ...</td>\n",
       "      <td>{'orgname': 'Kurt J. Lesker Company', 'city': ...</td>\n",
       "      <td>[{'last-name': 'Rayner, JR.', 'first-name': 'G...</td>\n",
       "      <td>\\nAn apparatus for atomic scale processing is ...</td>\n",
       "      <td>a reactor having inner and outer surfaces;\\nwh...</td>\n",
       "      <td>[apparatus, internal volume reactor, substrate...</td>\n",
       "      <td>[base pressure reactor, backfille process, pur...</td>\n",
       "      <td>20230230802</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>880</th>\n",
       "      <td>US</td>\n",
       "      <td>20230226141</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18157933, 'dat...</td>\n",
       "      <td>ANGIOTENSIN II ALONE OR IN COMBINATION FOR THE...</td>\n",
       "      <td>{'orgname': 'The George Washington University ...</td>\n",
       "      <td>[{'last-name': 'CHAWLA', 'first-name': 'Lakhmi...</td>\n",
       "      <td>\\nThe present invention relates, inter alia, t...</td>\n",
       "      <td>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n...</td>\n",
       "      <td>[method, invention, effective, treatment, outp...</td>\n",
       "      <td>[]</td>\n",
       "      <td>20230226141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>881</th>\n",
       "      <td>US</td>\n",
       "      <td>20230226142</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18166956, 'dat...</td>\n",
       "      <td>IONIC SELF-ASSEMBLING PEPTIDES</td>\n",
       "      <td>{'orgname': '3-D MATRIX, LTD.', 'city': 'Tokyo...</td>\n",
       "      <td>[{'last-name': 'Gil', 'first-name': 'Eun Seok'...</td>\n",
       "      <td>\\nProvided herein are ionic self-assembling pe...</td>\n",
       "      <td>\\n\\na) an N-terminal functional group selected...</td>\n",
       "      <td>[ionic self-assembling peptide, method, pharma...</td>\n",
       "      <td>[administer solution, pharmaceutical compositi...</td>\n",
       "      <td>20230226142</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>882</th>\n",
       "      <td>US</td>\n",
       "      <td>20230226143</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18011718, 'dat...</td>\n",
       "      <td>PHARMACEUTICAL COMPOSITION COMPRISING A COMBIN...</td>\n",
       "      <td>{'orgname': 'OCVIRK, Soren', 'city': 'Kranzber...</td>\n",
       "      <td>[{'last-name': 'Ocvirk', 'first-name': 'Sören'...</td>\n",
       "      <td>\\nA pharmaceutical composition includes a comb...</td>\n",
       "      <td>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n</td>\n",
       "      <td>[pharmaceutical composition, gastrointestinal ...</td>\n",
       "      <td>[]</td>\n",
       "      <td>20230226143</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>883</th>\n",
       "      <td>US</td>\n",
       "      <td>20230226144</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 18186639, 'dat...</td>\n",
       "      <td>TOPICAL ANTIBIOTIC</td>\n",
       "      <td>{'orgname': 'Concept Matrix Solutions', 'city'...</td>\n",
       "      <td>[{'last-name': 'LaRosa', 'first-name': 'Tony',...</td>\n",
       "      <td>\\nProvided herein is a topical antibiotic comp...</td>\n",
       "      <td>(a) at least one of bacitracin, bacitracin zin...</td>\n",
       "      <td>[skin surface, antibiotic agent, method, compo...</td>\n",
       "      <td>[sodium hydroxide, cetearyl alcohol, water, et...</td>\n",
       "      <td>20230226144</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>884</th>\n",
       "      <td>US</td>\n",
       "      <td>20230226145</td>\n",
       "      <td>20230720</td>\n",
       "      <td>{'country': 'US', 'doc-number': 17379987, 'dat...</td>\n",
       "      <td>Mutant Peptides And Methods Of Treating Subjec...</td>\n",
       "      <td>{'orgname': 'BIOINCEPT, LLC', 'city': 'New Yor...</td>\n",
       "      <td>[{'last-name': 'Barnea', 'first-name': 'Eytan ...</td>\n",
       "      <td>\\nThe disclosure relates to a pharmaceutical c...</td>\n",
       "      <td>\\n\\ni) a therapeutically effective amount of t...</td>\n",
       "      <td>[method, autoimmune disease, disclosure, pharm...</td>\n",
       "      <td>[pre-implantation factor (, composition]</td>\n",
       "      <td>20230226145</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>885 rows × 12 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    country   doc-number      date  \\\n",
       "0        US  20230227158  20230720   \n",
       "1        US  20230229051  20230720   \n",
       "2        US  20230229087  20230720   \n",
       "3        US  20230230714  20230720   \n",
       "4        US  20230230802  20230720   \n",
       "..      ...          ...       ...   \n",
       "880      US  20230226141  20230720   \n",
       "881      US  20230226142  20230720   \n",
       "882      US  20230226143  20230720   \n",
       "883      US  20230226144  20230720   \n",
       "884      US  20230226145  20230720   \n",
       "\n",
       "                                 application-reference  \\\n",
       "0    {'country': 'US', 'doc-number': 18123405, 'dat...   \n",
       "1    {'country': 'US', 'doc-number': 17577538, 'dat...   \n",
       "2    {'country': 'US', 'doc-number': 18098167, 'dat...   \n",
       "3    {'country': 'US', 'doc-number': 18010358, 'dat...   \n",
       "4    {'country': 'US', 'doc-number': 18178664, 'dat...   \n",
       "..                                                 ...   \n",
       "880  {'country': 'US', 'doc-number': 18157933, 'dat...   \n",
       "881  {'country': 'US', 'doc-number': 18166956, 'dat...   \n",
       "882  {'country': 'US', 'doc-number': 18011718, 'dat...   \n",
       "883  {'country': 'US', 'doc-number': 18186639, 'dat...   \n",
       "884  {'country': 'US', 'doc-number': 17379987, 'dat...   \n",
       "\n",
       "                                                 title  \\\n",
       "0    UNMANNED AERIAL SYSTEM AND METHOD FOR CONTACT ...   \n",
       "1    METHOD AND DEVICE FOR CONTROLLING STATES OF DY...   \n",
       "2                  UV-CURABLE QUANTUM DOT FORMULATIONS   \n",
       "3    CONTROL DRUM CONTROLLER FOR NUCLEAR REACTOR SY...   \n",
       "4    Ultra High Purity Conditions for Atomic Scale ...   \n",
       "..                                                 ...   \n",
       "880  ANGIOTENSIN II ALONE OR IN COMBINATION FOR THE...   \n",
       "881                     IONIC SELF-ASSEMBLING PEPTIDES   \n",
       "882  PHARMACEUTICAL COMPOSITION COMPRISING A COMBIN...   \n",
       "883                                 TOPICAL ANTIBIOTIC   \n",
       "884  Mutant Peptides And Methods Of Treating Subjec...   \n",
       "\n",
       "                                              assignee  \\\n",
       "0    {'orgname': 'Beirobotics LLC', 'city': 'Richmo...   \n",
       "1    {'orgname': 'FURCIFER INC.', 'city': 'FREMONT'...   \n",
       "2    {'orgname': 'Nanosys, Inc.', 'city': 'Milpitas...   \n",
       "3    {'orgname': 'Ultra Safe Nuclear Corporation', ...   \n",
       "4    {'orgname': 'Kurt J. Lesker Company', 'city': ...   \n",
       "..                                                 ...   \n",
       "880  {'orgname': 'The George Washington University ...   \n",
       "881  {'orgname': '3-D MATRIX, LTD.', 'city': 'Tokyo...   \n",
       "882  {'orgname': 'OCVIRK, Soren', 'city': 'Kranzber...   \n",
       "883  {'orgname': 'Concept Matrix Solutions', 'city'...   \n",
       "884  {'orgname': 'BIOINCEPT, LLC', 'city': 'New Yor...   \n",
       "\n",
       "                                             inventors  \\\n",
       "0    [{'last-name': 'Beiro', 'first-name': 'Michael...   \n",
       "1    [{'last-name': 'WANG', 'first-name': 'JIAN', '...   \n",
       "2    [{'last-name': 'IPPEN', 'first-name': 'Christi...   \n",
       "3    [{'last-name': 'Chaleff', 'first-name': 'Ethan...   \n",
       "4    [{'last-name': 'Rayner, JR.', 'first-name': 'G...   \n",
       "..                                                 ...   \n",
       "880  [{'last-name': 'CHAWLA', 'first-name': 'Lakhmi...   \n",
       "881  [{'last-name': 'Gil', 'first-name': 'Eun Seok'...   \n",
       "882  [{'last-name': 'Ocvirk', 'first-name': 'Sören'...   \n",
       "883  [{'last-name': 'LaRosa', 'first-name': 'Tony',...   \n",
       "884  [{'last-name': 'Barnea', 'first-name': 'Eytan ...   \n",
       "\n",
       "                                              abstract  \\\n",
       "0    \\nA system for performing work on electrical p...   \n",
       "1    \\nThe disclosure relates generally to a method...   \n",
       "2    \\nProvided are patterned films comprising nano...   \n",
       "3    \\nA nuclear reactor system includes a nuclear ...   \n",
       "4    \\nAn apparatus for atomic scale processing is ...   \n",
       "..                                                 ...   \n",
       "880  \\nThe present invention relates, inter alia, t...   \n",
       "881  \\nProvided herein are ionic self-assembling pe...   \n",
       "882  \\nA pharmaceutical composition includes a comb...   \n",
       "883  \\nProvided herein is a topical antibiotic comp...   \n",
       "884  \\nThe disclosure relates to a pharmaceutical c...   \n",
       "\n",
       "                                                claims  \\\n",
       "0    a power line tool adapted to perch on an energ...   \n",
       "1    selecting a desired optical state of the elect...   \n",
       "2           \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n   \n",
       "3    a pressure vessel;\\na nuclear reactor core dis...   \n",
       "4    a reactor having inner and outer surfaces;\\nwh...   \n",
       "..                                                 ...   \n",
       "880  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n...   \n",
       "881  \\n\\na) an N-terminal functional group selected...   \n",
       "882       \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n   \n",
       "883  (a) at least one of bacitracin, bacitracin zin...   \n",
       "884  \\n\\ni) a therapeutically effective amount of t...   \n",
       "\n",
       "                                     abstract_entities  \\\n",
       "0    [splice electrical power line, power line tool...   \n",
       "1    [method, optical state base, switch, power, di...   \n",
       "2    [electroluminescent device, method pattern, uv...   \n",
       "3    [moderator element, nuclear reactor core dispo...   \n",
       "4    [apparatus, internal volume reactor, substrate...   \n",
       "..                                                 ...   \n",
       "880  [method, invention, effective, treatment, outp...   \n",
       "881  [ionic self-assembling peptide, method, pharma...   \n",
       "882  [pharmaceutical composition, gastrointestinal ...   \n",
       "883  [skin surface, antibiotic agent, method, compo...   \n",
       "884  [method, autoimmune disease, disclosure, pharm...   \n",
       "\n",
       "                                        claim_entities          key  \n",
       "0    [power line tool, method, couple unmanned, sla...  20230227158  \n",
       "1    [controller, optical state base, switch, signa...  20230229051  \n",
       "2                                                   []  20230229087  \n",
       "3    [internal control drum, longitudinally pressur...  20230230714  \n",
       "4    [base pressure reactor, backfille process, pur...  20230230802  \n",
       "..                                                 ...          ...  \n",
       "880                                                 []  20230226141  \n",
       "881  [administer solution, pharmaceutical compositi...  20230226142  \n",
       "882                                                 []  20230226143  \n",
       "883  [sodium hydroxide, cetearyl alcohol, water, et...  20230226144  \n",
       "884           [pre-implantation factor (, composition]  20230226145  \n",
       "\n",
       "[885 rows x 12 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Read in the patent data\n",
    "df_patent = pd.read_json(filename_patents)\n",
    "df_patent['key'] = df_patent['doc-number']  # PS Change 12/08 12 PM\n",
    "#df_patent.head(5)\n",
    "\n",
    "# Display the DataFrame\n",
    "display(df_patent)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "0ce1fab1-7de6-4af7-b736-e1a49743381a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>key</th>\n",
       "      <th>doc-number</th>\n",
       "      <th>country</th>\n",
       "      <th>title</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20230227158</td>\n",
       "      <td>20230227158</td>\n",
       "      <td>US</td>\n",
       "      <td>UNMANNED AERIAL SYSTEM AND METHOD FOR CONTACT ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>20230229051</td>\n",
       "      <td>20230229051</td>\n",
       "      <td>US</td>\n",
       "      <td>METHOD AND DEVICE FOR CONTROLLING STATES OF DY...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>20230229087</td>\n",
       "      <td>20230229087</td>\n",
       "      <td>US</td>\n",
       "      <td>UV-CURABLE QUANTUM DOT FORMULATIONS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>20230230714</td>\n",
       "      <td>20230230714</td>\n",
       "      <td>US</td>\n",
       "      <td>CONTROL DRUM CONTROLLER FOR NUCLEAR REACTOR SY...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>20230230802</td>\n",
       "      <td>20230230802</td>\n",
       "      <td>US</td>\n",
       "      <td>Ultra High Purity Conditions for Atomic Scale ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>880</th>\n",
       "      <td>20230226141</td>\n",
       "      <td>20230226141</td>\n",
       "      <td>US</td>\n",
       "      <td>ANGIOTENSIN II ALONE OR IN COMBINATION FOR THE...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>881</th>\n",
       "      <td>20230226142</td>\n",
       "      <td>20230226142</td>\n",
       "      <td>US</td>\n",
       "      <td>IONIC SELF-ASSEMBLING PEPTIDES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>882</th>\n",
       "      <td>20230226143</td>\n",
       "      <td>20230226143</td>\n",
       "      <td>US</td>\n",
       "      <td>PHARMACEUTICAL COMPOSITION COMPRISING A COMBIN...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>883</th>\n",
       "      <td>20230226144</td>\n",
       "      <td>20230226144</td>\n",
       "      <td>US</td>\n",
       "      <td>TOPICAL ANTIBIOTIC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>884</th>\n",
       "      <td>20230226145</td>\n",
       "      <td>20230226145</td>\n",
       "      <td>US</td>\n",
       "      <td>Mutant Peptides And Methods Of Treating Subjec...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>885 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "             key   doc-number country  \\\n",
       "0    20230227158  20230227158      US   \n",
       "1    20230229051  20230229051      US   \n",
       "2    20230229087  20230229087      US   \n",
       "3    20230230714  20230230714      US   \n",
       "4    20230230802  20230230802      US   \n",
       "..           ...          ...     ...   \n",
       "880  20230226141  20230226141      US   \n",
       "881  20230226142  20230226142      US   \n",
       "882  20230226143  20230226143      US   \n",
       "883  20230226144  20230226144      US   \n",
       "884  20230226145  20230226145      US   \n",
       "\n",
       "                                                 title  \n",
       "0    UNMANNED AERIAL SYSTEM AND METHOD FOR CONTACT ...  \n",
       "1    METHOD AND DEVICE FOR CONTROLLING STATES OF DY...  \n",
       "2                  UV-CURABLE QUANTUM DOT FORMULATIONS  \n",
       "3    CONTROL DRUM CONTROLLER FOR NUCLEAR REACTOR SY...  \n",
       "4    Ultra High Purity Conditions for Atomic Scale ...  \n",
       "..                                                 ...  \n",
       "880  ANGIOTENSIN II ALONE OR IN COMBINATION FOR THE...  \n",
       "881                     IONIC SELF-ASSEMBLING PEPTIDES  \n",
       "882  PHARMACEUTICAL COMPOSITION COMPRISING A COMBIN...  \n",
       "883                                 TOPICAL ANTIBIOTIC  \n",
       "884  Mutant Peptides And Methods Of Treating Subjec...  \n",
       "\n",
       "[885 rows x 4 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "selected_columns3 = ['key','doc-number', 'country',  'application-reference', 'title', 'assignee', 'inventors']\n",
    "selected_columns4 = ['key', 'abstract','abstract_entities']  ##need to remove/update  #PS update 12/08/1:45 PM\n",
    "\n",
    "#selected_columns4 = ['key', 'abstract_entities']  ## need to add\n",
    "\n",
    "selected_columns3 = [col.strip() for col in selected_columns3]\n",
    "selected_columns4 = [col.strip() for col in selected_columns4]\n",
    "\n",
    "df_patents = df_patent[selected_columns3]\n",
    "df_patents_main = df_patents[['key','doc-number', 'country', 'title']]\n",
    "df_patentsent= df_patent[selected_columns4]\n",
    "\n",
    "#df_patentsent.rename(columns={'abstract': 'abstract_entities'}, inplace=True)\n",
    "display(df_patents_main)\n",
    "df_patents_main.to_csv('./preprocessed_files/neo4j_patents_main.csv', index=False)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "8d6cf6e2-16aa-46c0-a280-b3990d53b33f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>key</th>\n",
       "      <th>abstract</th>\n",
       "      <th>abstract_entities</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20230227158</td>\n",
       "      <td>\\nA system for performing work on electrical p...</td>\n",
       "      <td>splice electrical power line</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20230227158</td>\n",
       "      <td>\\nA system for performing work on electrical p...</td>\n",
       "      <td>power line tool</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20230227158</td>\n",
       "      <td>\\nA system for performing work on electrical p...</td>\n",
       "      <td>electrical power line</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20230227158</td>\n",
       "      <td>\\nA system for performing work on electrical p...</td>\n",
       "      <td>attachment point support</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20230227158</td>\n",
       "      <td>\\nA system for performing work on electrical p...</td>\n",
       "      <td>system</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>883</th>\n",
       "      <td>20230226144</td>\n",
       "      <td>\\nProvided herein is a topical antibiotic comp...</td>\n",
       "      <td>composition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>884</th>\n",
       "      <td>20230226145</td>\n",
       "      <td>\\nThe disclosure relates to a pharmaceutical c...</td>\n",
       "      <td>method</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>884</th>\n",
       "      <td>20230226145</td>\n",
       "      <td>\\nThe disclosure relates to a pharmaceutical c...</td>\n",
       "      <td>autoimmune disease</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>884</th>\n",
       "      <td>20230226145</td>\n",
       "      <td>\\nThe disclosure relates to a pharmaceutical c...</td>\n",
       "      <td>disclosure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>884</th>\n",
       "      <td>20230226145</td>\n",
       "      <td>\\nThe disclosure relates to a pharmaceutical c...</td>\n",
       "      <td>pharmaceutical composition</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6612 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "             key                                           abstract  \\\n",
       "0    20230227158  \\nA system for performing work on electrical p...   \n",
       "0    20230227158  \\nA system for performing work on electrical p...   \n",
       "0    20230227158  \\nA system for performing work on electrical p...   \n",
       "0    20230227158  \\nA system for performing work on electrical p...   \n",
       "0    20230227158  \\nA system for performing work on electrical p...   \n",
       "..           ...                                                ...   \n",
       "883  20230226144  \\nProvided herein is a topical antibiotic comp...   \n",
       "884  20230226145  \\nThe disclosure relates to a pharmaceutical c...   \n",
       "884  20230226145  \\nThe disclosure relates to a pharmaceutical c...   \n",
       "884  20230226145  \\nThe disclosure relates to a pharmaceutical c...   \n",
       "884  20230226145  \\nThe disclosure relates to a pharmaceutical c...   \n",
       "\n",
       "                abstract_entities  \n",
       "0    splice electrical power line  \n",
       "0                 power line tool  \n",
       "0           electrical power line  \n",
       "0        attachment point support  \n",
       "0                          system  \n",
       "..                            ...  \n",
       "883                   composition  \n",
       "884                        method  \n",
       "884            autoimmune disease  \n",
       "884                    disclosure  \n",
       "884    pharmaceutical composition  \n",
       "\n",
       "[6612 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "df_source_patent = df_patentsent\n",
    "\n",
    "# Convert the string representation to a list\n",
    "#(need to update)\n",
    "#df_source_patent['abstract_entities'] = df_source_patent['abstract_entities'].apply(ast.literal_eval)\n",
    "\n",
    "# Explode the 'abstract_entities' column\n",
    "#(need to update)\n",
    "df_exploded_patents = df_source_patent.explode('abstract_entities') #PS update 12/08/1:45 PM\n",
    "\n",
    "\n",
    "# Display the resulting DataFrame\n",
    "display(df_exploded_patents)\n",
    "\n",
    "df_exploded_patents.to_csv('./preprocessed_files/neo4j_patents_abstract.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "741c2235-9963-4aba-bb92-68171df3c051",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Functions used to navigate json file and extract information\n",
    "\n",
    "# This function helps deal with errors when looking for values in the json file\n",
    "def safe_eval(value):\n",
    "    try:\n",
    "        return literal_eval(value)\n",
    "    except (ValueError, SyntaxError):\n",
    "        return value\n",
    "\n",
    "# If there is only 1 level of nesting, this function will extract the data\n",
    "def flatten_nested_columns(df, column_name):\n",
    "    # Use safe_eval to handle malformed data\n",
    "    df[column_name] = df[column_name].apply(safe_eval)\n",
    "    \n",
    "    # Flatten the nested dictionary\n",
    "    df_flat = pd.concat([df.drop(column_name, axis=1),\n",
    "                        json_normalize(df[column_name])], axis=1)\n",
    "    \n",
    "    return df_flat\n",
    "\n",
    "# If there are 2 levels of nesting, this function will extract the data\n",
    "def flatten_nested_nested_columns(df, column_name):\n",
    "    df[column_name] = df[column_name].apply(safe_eval)\n",
    "    \n",
    "    # Create an empty DataFrame to store the flattened results\n",
    "    df_flat = pd.DataFrame()\n",
    "    \n",
    "    # Iterate over each row\n",
    "    for _, row in df.iterrows():\n",
    "        # Flatten the nested column using json_normalize for each row\n",
    "        df_row_flat = pd.json_normalize(row[column_name]).reset_index(drop=True)\n",
    "        \n",
    "        # Add the id_doc-number to the flattened DataFrame\n",
    "        df_row_flat['key'] = row['key']\n",
    "        \n",
    "        # Concatenate the results for each row\n",
    "        df_flat = pd.concat([df_flat, df_row_flat], ignore_index=True)\n",
    "    \n",
    "    return df_flat"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e6acaa96-025f-42e0-b625-9f6fc5b0364f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "             key country  doc-number      date\n",
      "0    20230227158      US    18123405  20230320\n",
      "1    20230229051      US    17577538  20220118\n",
      "2    20230229087      US    18098167  20230118\n",
      "3    20230230714      US    18010358  20220817\n",
      "4    20230230802      US    18178664  20230306\n",
      "..           ...     ...         ...       ...\n",
      "880  20230226141      US    18157933  20230123\n",
      "881  20230226142      US    18166956  20230209\n",
      "882  20230226143      US    18011718  20200630\n",
      "883  20230226144      US    18186639  20230320\n",
      "884  20230226145      US    17379987  20210719\n",
      "\n",
      "[885 rows x 4 columns]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_57989/1872703005.py:13: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  df[column_name] = df[column_name].apply(safe_eval)\n"
     ]
    }
   ],
   "source": [
    "# 1st Flattening, which is used to generate the patent application reference node and associated properties\n",
    "# This is the root node for patents\n",
    "\n",
    "# Create a DataFrame\n",
    "df = df_patents[['key','application-reference']]\n",
    "\n",
    "# Flatten the specified nested column\n",
    "df_flat = flatten_nested_columns(df, 'application-reference')\n",
    "\n",
    "# Display the flattened DataFrame\n",
    "print(df_flat)\n",
    "\n",
    "df_flat.to_csv('./preprocessed_files/neo4j_patents_application_reference.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "60e66892-1b04-4bbe-bca0-9912a8260f4c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "             key                                            orgname  \\\n",
      "0    20230227158                                    Beirobotics LLC   \n",
      "1    20230229051                                      FURCIFER INC.   \n",
      "2    20230229087                                      Nanosys, Inc.   \n",
      "3    20230230714                     Ultra Safe Nuclear Corporation   \n",
      "4    20230230802                             Kurt J. Lesker Company   \n",
      "..           ...                                                ...   \n",
      "880  20230226141  The George Washington University a Congression...   \n",
      "881  20230226142                                   3-D MATRIX, LTD.   \n",
      "882  20230226143                                      OCVIRK, Soren   \n",
      "883  20230226144                           Concept Matrix Solutions   \n",
      "884  20230226145                                     BIOINCEPT, LLC   \n",
      "\n",
      "                city state country  \n",
      "0           Richmond    VA      US  \n",
      "1            FREMONT    CA      US  \n",
      "2           Milpitas    CA      US  \n",
      "3            Seattle    WA      US  \n",
      "4    Jefferson Hills    PA      US  \n",
      "..               ...   ...     ...  \n",
      "880       Washington    DC      US  \n",
      "881            Tokyo   NaN      JP  \n",
      "882        Kranzberg   NaN      DE  \n",
      "883     Newbury park    CA      US  \n",
      "884         New York    NY      US  \n",
      "\n",
      "[885 rows x 5 columns]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_57989/1872703005.py:13: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  df[column_name] = df[column_name].apply(safe_eval)\n"
     ]
    }
   ],
   "source": [
    "#2nd Flattening, which is used to extract the assignee node and its associated properties\n",
    "# data\n",
    "df = df_patents[['key','assignee']]\n",
    "\n",
    "# Flatten the specified nested column\n",
    "df_flat = flatten_nested_columns(df, 'assignee')\n",
    "\n",
    "# Display the flattened DataFrame\n",
    "print(df_flat)\n",
    "\n",
    "\n",
    "df_flat.to_csv('./preprocessed_files/neo4j_patents_assignee.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "38508751-c134-4891-836a-dc9c240e957e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "        last-name       first-name                city state country  \\\n",
      "0           Beiro  Michael Kenneth            Richmond    VA      US   \n",
      "1     Corbin, III      Alvin Leroy             Dillwyn    VA      US   \n",
      "2           Coble   Chase Hamilton  North Chesterfield    VA      US   \n",
      "3           Schul     David Carson            Richmond    VA      US   \n",
      "4            WANG             JIAN             FREMONT    CA      US   \n",
      "...           ...              ...                 ...   ...     ...   \n",
      "2750       Ocvirk            Sören           Kranzberg   NaN      DE   \n",
      "2751       LaRosa             Tony      Woodland Hills    CA      US   \n",
      "2752     Davidson           Robert      Woodland Hills    CA      US   \n",
      "2753         Reid            David     Woodland Hillls    CA      US   \n",
      "2754       Barnea         Eytan R.            New York    NY      US   \n",
      "\n",
      "              key  \n",
      "0     20230227158  \n",
      "1     20230227158  \n",
      "2     20230227158  \n",
      "3     20230227158  \n",
      "4     20230229051  \n",
      "...           ...  \n",
      "2750  20230226143  \n",
      "2751  20230226144  \n",
      "2752  20230226144  \n",
      "2753  20230226144  \n",
      "2754  20230226145  \n",
      "\n",
      "[2755 rows x 6 columns]\n"
     ]
    }
   ],
   "source": [
    "#3rd Flattening\n",
    "\n",
    "# Extract specific columns\n",
    "df = df_patents[['key', 'inventors']].dropna()\n",
    "\n",
    "# Flatten the specified nested column\n",
    "df_flat = flatten_nested_nested_columns(df, 'inventors')\n",
    "\n",
    "# Display the flattened DataFrame\n",
    "print(df_flat)\n",
    "\n",
    "\n",
    "df_flat.to_csv('./preprocessed_files/neo4j_patents_inventors.csv', index=False)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1df7a7c5-f628-4f3b-a805-0a5b76d82f8a",
   "metadata": {},
   "source": [
    "## 4 - Copy Data files to neo4j data directory"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "f1a2f10f-ba27-40a3-a878-d28e245b2e0d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# delete any csv from neo4j director if required\n",
    "#!rm '/Users/prakhar/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-c1b4f9c3-baa6-45d6-a13c-31ec4ba4c393/import'/*.csv\n",
    "#!ls '/Users/prakhar/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-c1b4f9c3-baa6-45d6-a13c-31ec4ba4c393/import'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "093cac14-0670-40ef-87ca-d43033a1a2e9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b''\n",
      "b''\n",
      "b''\n",
      "b''\n",
      "b''\n",
      "b''\n",
      "b''\n",
      "b''\n",
      "b''\n",
      "b'llama_similarity.csv\\nneo4j_patents_abstract.csv\\nneo4j_patents_application_reference.csv\\nneo4j_patents_assignee.csv\\nneo4j_patents_inventors.csv\\nneo4j_patents_main.csv\\nneo4j_sbir_abstract.csv\\nneo4j_sbir_abstract_entities.csv\\nneo4j_sbir_main.csv\\n'\n"
     ]
    }
   ],
   "source": [
    "#subprocess.run([\"ls\", \"-l\"])\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_sbir_main.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_patents_main.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_patents_abstract.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_patents_application_reference.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_patents_assignee.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_patents_inventors.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/llama_similarity.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"cp\" ,\"./preprocessed_files/neo4j_sbir_abstract_entities.csv\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "output = subprocess.run([\"ls\", neo4j_import_dir], shell=False, capture_output=True) \n",
    "print(output.stderr)\n",
    "print(output.stdout)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75ad8467-9286-45b0-a1d9-e169b1f690b1",
   "metadata": {},
   "source": [
    "## 5 - Create nodes and edges in neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "17598234-bddc-4182-9156-50e10d9edf79",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Define the Cypher query to load data and define nodes and edges from SBIR\n",
    "cypher_query_sbir1 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_sbir_main.csv' AS row\n",
    "\n",
    "// Create Location nodes\n",
    "MERGE (location:Location {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  city: COALESCE(row.City, 'Unknown'),\n",
    "  state: COALESCE(row.State, 'Unknown'),\n",
    "  zip: COALESCE(row.Zip, 'Unknown'),\n",
    "  address1: COALESCE(row.Address1, 'Unknown'),\n",
    "  address2: COALESCE(row.Address2, 'Unknown')\n",
    "})\n",
    "\n",
    "// Create Agency nodes\n",
    "MERGE (agency:Agency {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  name: COALESCE(row.Agency, 'Unknown'),\n",
    "  branch: COALESCE(row.Branch, 'Unknown'),\n",
    "  website: COALESCE(row.`Company Website`, 'Unknown')\n",
    "})\n",
    "\n",
    "// Create Abstract Topic nodes\n",
    "MERGE (sbir_award:Sbir_Award {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  topic_code: COALESCE(row.`Topic Code`, 'Unknown'),\n",
    "  award_title: COALESCE(row.`Award Title`, 'Unknown'),\n",
    "  award_year: COALESCE(row.`Award Year`, 'Unknown'),\n",
    "  award_amount: TOFLOAT(COALESCE(row.`Award Amount`, '0.0'))\n",
    "\n",
    "})\n",
    "\n",
    "// Create Principal nodes\n",
    "MERGE (principal:Principal {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  company: COALESCE(row.Company, 'Unknown'),\n",
    "  pi_name: COALESCE(row.`PI Name`, 'Unknown'),\n",
    "  pi_title: COALESCE(row.`PI Title`, 'Unknown'),\n",
    "  pi_phone: COALESCE(row.`PI Phone`, 'Unknown'),\n",
    "  pi_email: COALESCE(row.`PI Email`, 'Unknown'),\n",
    "  hubzone_owned: COALESCE(row.`HUBZone Owned`, 'Unknown'),\n",
    "  socially_economically_disadvantaged: COALESCE(row.`Socially and Economically Disadvantaged`, 'Unknown'),\n",
    "  women_owned: COALESCE(row.`Women Owned`, 'Unknown')\n",
    "})\n",
    "\n",
    "// Create relationships\n",
    "CREATE (agency)-[:OVERSEES]->(sbir_award)\n",
    "CREATE (sbir_award)-[:AWARDED_TO]->(principal)\n",
    "CREATE (principal)-[:WORKSIN]->(location)\n",
    "\"\"\"\n",
    "#granted to relationship rather belongs to\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_sbir1)\n",
    "\n",
    "# Define the Cypher query to load data from the second CSV file and create nodes\n",
    "cypher_query_sbir2 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_sbir_abstract_entities.csv' AS row\n",
    "\n",
    "// Create Abstract nodes\n",
    "MERGE (sbir_abstract:Sbir_Abstract {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  Abstract: COALESCE(row.Abstract, 'Unknown')\n",
    "})\n",
    "\n",
    "\n",
    "// Create Entities nodes\n",
    "MERGE (entities:Entities {\n",
    "  entities: COALESCE(row.entities, 'Unknown')\n",
    "})\n",
    "\n",
    "// Create relationships\n",
    "CREATE (sbir_abstract)-[:HOLDS]->(entities)\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_sbir2)\n",
    "\n",
    "# Create relationships between nodes from the second file and existing nodes from the first file\n",
    "cypher_query_sbir3 = \"\"\"\n",
    "MATCH (sbir_award:Sbir_Award), (principal:Principal), (sbir_abstract:Sbir_Abstract)\n",
    "WHERE sbir_award.key = principal.key AND principal.key = sbir_abstract.key\n",
    "CREATE (sbir_award)-[:CONTAINS]->(sbir_abstract)\n",
    "CREATE (principal)-[:RESEARCHED]->(sbir_abstract)\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_sbir3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e2b30007-c5d2-460b-a3e7-679057301fdf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Define the Cypher query to load data and define nodes and edges from Patents\n",
    "cypher_query_patents1 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_patents_main.csv' AS row\n",
    "\n",
    "// Create Title nodes\n",
    "MERGE (title_pt:Title_PT {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  doc_number: COALESCE(row.`doc-number`, 'Unknown'),\n",
    "  title: COALESCE(row.title, 'Unknown'),\n",
    "  country: COALESCE(row.country, 'Unknown')\n",
    "})\n",
    "\n",
    "\"\"\"\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_patents1)\n",
    "\n",
    "\n",
    "# Define the Cypher query to load data from the second CSV file and create nodes\n",
    "cypher_query_patents2 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_patents_application_reference.csv' AS row\n",
    "\n",
    "// Create appplication ref nodes\n",
    "MERGE (application_ref_pt:Application_Ref_PT {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  doc_number: COALESCE(row.`doc-number`, 'Unknown'),\n",
    "  country: COALESCE(row.country, 'Unknown'),\n",
    "  date: COALESCE(row.date, 'Unknown')\n",
    "})\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_patents2)\n",
    "\n",
    "\n",
    "# Define the Cypher query to load data from the second CSV file and create nodes\n",
    "cypher_query_patents3 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_patents_assignee.csv' AS row\n",
    "\n",
    "// Create assignee nodes\n",
    "MERGE (assignee_pt:Assignee_PT {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  orgname: COALESCE(row.orgname, 'Unknown'),\n",
    "  city: COALESCE(row.city, 'Unknown'),\n",
    "  state: COALESCE(row.state, 'Unknown'),\n",
    "  country: COALESCE(row.country, 'Unknown')\n",
    "});\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_patents3)\n",
    "\n",
    "# Define the Cypher query to load data from the second CSV file and create nodes\n",
    "cypher_query_patents4 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_patents_inventors.csv' AS row\n",
    "\n",
    "// Create assignee nodes\n",
    "MERGE (inventors_pt:Inventors_PT {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  first_name: COALESCE(row.`first-name`, 'Unknown'),\n",
    "  last_name: COALESCE(row.`last-name`, 'Unknown'),\n",
    "  city: COALESCE(row.city, 'Unknown'),\n",
    "  state: COALESCE(row.state, 'Unknown'),\n",
    "  country: COALESCE(row.country, 'Unknown') \n",
    "})\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_patents4)\n",
    "\n",
    "\n",
    "# Define the Cypher query to load data from the second CSV file and create nodes\n",
    "cypher_query_patents5 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///neo4j_patents_abstract.csv' AS row\n",
    "\n",
    "// Create Abstract nodes\n",
    "MERGE (patent_abstract:Patent_Abstract {\n",
    "  key: COALESCE(toInteger(row.key), 0),\n",
    "  Abstract: COALESCE(row.abstract, 'Unknown')\n",
    "})\n",
    "\n",
    "\n",
    "// Create Entities nodes\n",
    "MERGE (entities:Entities {\n",
    "  entities: COALESCE(row.abstract_entities, 'Unknown')\n",
    "})\n",
    "\n",
    "// Create relationships\n",
    "CREATE (patent_abstract)-[:HOLDS_PT]->(entities)\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_patents5)\n",
    "\n",
    "# Create relationships between nodes from the second file and existing nodes from the first file\n",
    "cypher_query_patents6 = \"\"\"\n",
    "MATCH (title_pt:Title_PT) , (assignee_pt:Assignee_PT), (inventors_pt:Inventors_PT), (applications_ref_pt:Application_Ref_PT), (patent_abstract:Patent_Abstract)\n",
    "WHERE title_pt.key = assignee_pt.key AND  assignee_pt.key = inventors_pt.key AND inventors_pt.key = applications_ref_pt.key AND applications_ref_pt.key = patent_abstract.key\n",
    "CREATE (title_pt)-[:ASSIGN_PT]->(assignee_pt)\n",
    "CREATE (title_pt)-[:CREATED_BY_PT]->(inventors_pt)\n",
    "CREATE (inventors_pt)-[:RESEARCHED_PT]->(patent_abstract)\n",
    "CREATE (applications_ref_pt)-[:CONTAINS_PT]->(patent_abstract)\n",
    "CREATE (patent_abstract)-[:ASSIGNED_PT]->(assignee_pt)\n",
    "CREATE (title_pt)-[:HAS_PT]->(patent_abstract)\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query_patents6)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "428d5027-5388-410c-a9d6-b37d01bb0cb6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create relationships based on similarity\n",
    "cypher_query7 = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///llama_similarity.csv' AS row\n",
    "MATCH (sbir_abstract:Sbir_Abstract {key: toInteger(row.sbir_id)})\n",
    "MATCH (patent_abstract:Patent_Abstract {key: toInteger(row.patent_id)})\n",
    "MERGE (sbir_abstract)-[:SIMILARITY_SCORE {score: COALESCE(toFloat(row.score), 0.0)}]->(patent_abstract);\n",
    "\"\"\"\n",
    "\n",
    "# Execute the Cypher query\n",
    "graph.run(cypher_query7)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e9a4618-59e5-4421-88ea-a4e708dabf34",
   "metadata": {},
   "source": [
    "## 6 - Test Queries (Optional)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "161d6541-6eb1-47a2-b023-b04849fa64bd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>count(n)</th></tr><tr><td style=\"text-align:right\">26947</td></tr></table>"
      ],
      "text/plain": [
       " count(n) \n",
       "----------\n",
       "    26947 "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# // Count all nodes\n",
    "cypher_query_check = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN count(n)\n",
    "\"\"\"\n",
    "graph.run(cypher_query_check)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b9aa40f3-15e3-4585-bbc1-840a313770ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>principal.pi_name</th></tr><tr><td style=\"text-align:left\">Andrew Chepaitis</td></tr><tr><td style=\"text-align:left\">Yan Ivnitskiy</td></tr><tr><td style=\"text-align:left\">Harper Langston</td></tr></table>"
      ],
      "text/plain": [
       " principal.pi_name \n",
       "-------------------\n",
       " Andrew Chepaitis  \n",
       " Yan Ivnitskiy     \n",
       " Harper Langston   "
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#//  condition for Location\n",
    "cypher_query_check = \"\"\"\n",
    "MATCH (principal:Principal)-[:WORKSIN]->(location:Location)\n",
    "WHERE location.city = 'New York'\n",
    "RETURN principal.pi_name;\n",
    "\"\"\"\n",
    "graph.run(cypher_query_check)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2f68f8f-305c-4862-af8d-5391c839abc2",
   "metadata": {},
   "source": [
    "## 7 - Conduct Queries to answer questions posed for Final Project"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "f1617665-e771-4b0f-aa2f-136fe8e60f0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>location.state</th><th>sbir_awards</th></tr><tr><td style=\"text-align:left\">CA</td><td style=\"text-align:right\">6</td></tr><tr><td style=\"text-align:left\">VA</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">MD</td><td style=\"text-align:right\">2</td></tr></table>"
      ],
      "text/plain": [
       " location.state | sbir_awards \n",
       "----------------|-------------\n",
       " CA             |           6 \n",
       " VA             |           3 \n",
       " MD             |           2 "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#1. What states receive the most SBIR awards in a variety of technology areas?\n",
    "cypher_FP_query1 = \"\"\"\n",
    "MATCH (sbir_award:Sbir_Award)-[:AWARDED_TO]->(principal:Principal)-[:WORKSIN]->(location:Location)\n",
    "MATCH (sbir_award:Sbir_Award)-[:CONTAINS]->(sbir_abstract)-[:HOLDS]->(e:Entities)\n",
    "WHERE toLower(e.entities) = \"communication\"\n",
    "RETURN location.state, COUNT(DISTINCT sbir_award.key) AS sbir_awards\n",
    "ORDER BY sbir_awards DESC LIMIT 10;\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "bc531c36-61e4-4c65-a956-ea720f7bd07a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>states</th><th>SBIR_PATENT_COUNT</th></tr><tr><td style=\"text-align:left\">CA</td><td style=\"text-align:right\">6</td></tr><tr><td style=\"text-align:left\">VA</td><td style=\"text-align:right\">3</td></tr><tr><td style=\"text-align:left\">PA</td><td style=\"text-align:right\">2</td></tr></table>"
      ],
      "text/plain": [
       " states | SBIR_PATENT_COUNT \n",
       "--------|-------------------\n",
       " CA     |                 6 \n",
       " VA     |                 3 \n",
       " PA     |                 2 "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#2. What states are leading research in the area of technology x (ex: Photonics)?\n",
    "cypher_FP_query2 = \"\"\"\n",
    "CALL {\n",
    "    MATCH (title_pt)-[:ASSIGN_PT]->(assignee_pt)\n",
    "    MATCH (title_pt)-[:CREATED_BY_PT]->(inventors_pt)-[:RESEARCHED_PT]->(Patent_Abstract)-[:HOLDS_PT]->(e:Entities)\n",
    "    WHERE toLower(e.entities) = 'communication'\n",
    "    RETURN assignee_pt.state as states, COUNT(DISTINCT title_pt.key) AS SBIR_PATENT_COUNT\n",
    "    UNION\n",
    "    MATCH (title_pt)-[:ASSIGN_PT]->(assignee_pt)\n",
    "    MATCH (title_pt)-[:CREATED_BY_PT]->(inventors_pt)-[:RESEARCHED_PT]->(Patent_Abstract)-[:HOLDS_PT]->(e:Entities)\n",
    "    WHERE toLower(e.entities) = 'communication'\n",
    "    RETURN inventors_pt.state as states,COUNT(DISTINCT title_pt.key) AS SBIR_PATENT_COUNT\n",
    "    UNION\n",
    "    MATCH (sbir_award:Sbir_Award)-[:AWARDED_TO]->(principal:Principal)-[:WORKSIN]->(location:Location)\n",
    "    MATCH (sbir_award:Sbir_Award)-[:CONTAINS]->(sbir_abstract)-[:HOLDS]->(e:Entities)\n",
    "    WHERE toLower(e.entities) = \"communication\"\n",
    "    RETURN location.state as states, COUNT(DISTINCT sbir_award.key) AS SBIR_PATENT_COUNT\n",
    "}\n",
    "RETURN states, SBIR_PATENT_COUNT\n",
    "ORDER BY SBIR_PATENT_COUNT DESC\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "453a7680-84fb-4591-90ed-8c10d1a75473",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>location.state</th><th>Total_Award_Amount</th></tr><tr><td style=\"text-align:left\">CA</td><td style=\"text-align:right\">80252207.0</td></tr><tr><td style=\"text-align:left\">MA</td><td style=\"text-align:right\">33537820.0</td></tr><tr><td style=\"text-align:left\">VA</td><td style=\"text-align:right\">24627717.0</td></tr></table>"
      ],
      "text/plain": [
       " location.state | Total_Award_Amount \n",
       "----------------|--------------------\n",
       " CA             |         80252207.0 \n",
       " MA             |         33537820.0 \n",
       " VA             |         24627717.0 "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#3. What states are benefiting the most from SBIR?\n",
    "cypher_FP_query3 = \"\"\"\n",
    "MATCH (sbir:Sbir_Award)-[:AWARDED_TO]->(principal:Principal)-[:WORKSIN]->(location:Location)\n",
    "RETURN location.state, SUM(sbir.award_amount) AS Total_Award_Amount\n",
    "ORDER BY Total_Award_Amount DESC\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "bcc081aa-4d4f-4e7d-a8ed-b90fa7f46d59",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>Principal.company</th><th>total_award</th></tr><tr><td style=\"text-align:left\">Nanosys</td><td style=\"text-align:right\">5563666.0</td></tr><tr><td style=\"text-align:left\">CREARE LLC</td><td style=\"text-align:right\">4033594.0</td></tr><tr><td style=\"text-align:left\">Thermedical Inc.</td><td style=\"text-align:right\">3678980.0</td></tr></table>"
      ],
      "text/plain": [
       " Principal.company | total_award \n",
       "-------------------|-------------\n",
       " Nanosys           |   5563666.0 \n",
       " CREARE LLC        |   4033594.0 \n",
       " Thermedical Inc.  |   3678980.0 "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#4.What businesses receive the most SBIR awards\n",
    "cypher_FP_query4 = \"\"\"\n",
    "MATCH (Sbir_Award)-[:AWARDED_TO]->(Principal)\n",
    "RETURN Principal.company, sum(Sbir_Award.award_amount) AS total_award\n",
    "ORDER BY total_award desc;\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "9426be78-b7cb-42cf-8c45-01f0756f01a3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>patent_assignee</th><th>SBIR_awardee</th></tr><tr><td style=\"text-align:left\">Andluca Technologies Inc.</td><td style=\"text-align:left\">Andluca Technologies Inc.</td></tr><tr><td style=\"text-align:left\">Intuitive Surgical Operations, Inc.</td><td style=\"text-align:left\">INTUITIVE SURGICAL</td></tr><tr><td style=\"text-align:left\">Ultra Safe Nuclear Corporation</td><td style=\"text-align:left\">Ultra Safe Nuclear Corporation</td></tr></table>"
      ],
      "text/plain": [
       " patent_assignee                     | SBIR_awardee                   \n",
       "-------------------------------------|--------------------------------\n",
       " Andluca Technologies Inc.           | Andluca Technologies Inc.      \n",
       " Intuitive Surgical Operations, Inc. | INTUITIVE SURGICAL             \n",
       " Ultra Safe Nuclear Corporation      | Ultra Safe Nuclear Corporation "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#5. Did they receive any patents on the same topic?\n",
    "cypher_FP_query5 = \"\"\"\n",
    "MATCH (assignee_pt:Assignee_PT)<-[]-(Patent_Abstract)-[]->(Entities)<-[]-(Sbir_Abstract)<-[]-(p:Principal)\n",
    "WHERE toLower(assignee_pt.orgname) contains toLower(p.company)\n",
    "RETURN distinct assignee_pt.orgname as patent_assignee, p.company as SBIR_awardee\n",
    "order by patent_assignee;\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "72b7ef9d-0d95-4ae3-b84b-3b25141bec46",
   "metadata": {},
   "outputs": [],
   "source": [
    "#6. How many additional patents the businesses generated 1 year after the SBIR award completed?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "54b4e630-6b66-4dc0-b34b-8ede915f3e00",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>INTRESTING_TECHNOLOGY</th><th>ENTITY_COUNT</th></tr><tr><td style=\"text-align:left\">method</td><td style=\"text-align:right\">7200</td></tr><tr><td style=\"text-align:left\">system</td><td style=\"text-align:right\">7139</td></tr><tr><td style=\"text-align:left\">patient</td><td style=\"text-align:right\">4032</td></tr></table>"
      ],
      "text/plain": [
       " INTRESTING_TECHNOLOGY | ENTITY_COUNT \n",
       "-----------------------|--------------\n",
       " method                |         7200 \n",
       " system                |         7139 \n",
       " patient               |         4032 "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#7. What technology areas are receiving the most interest from Government agencies and have patent filings?\n",
    "cypher_FP_query7 = \"\"\"\n",
    "MATCH (agency:Agency)-[:OVERSEES]->(sbir_award:Sbir_Award)-[:CONTAINS]->(sbir_abstract:Sbir_Abstract)-[:HOLDS]->(entities:Entities)<-[:HOLDS_PT]-(patent_abstract:Patent_Abstract)\n",
    "RETURN entities.entities AS INTRESTING_TECHNOLOGY, count(entities.entities) AS ENTITY_COUNT ORDER BY ENTITY_COUNT DESC;\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query7)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "da6be27f-2e0c-4cd9-866f-4fdcfc237d8a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>entity</th><th>company</th></tr><tr><td style=\"text-align:left\">3-dimensional</td><td style=\"text-align:left\">reactive innovations, llc</td></tr><tr><td style=\"text-align:left\">3-dimensional</td><td style=\"text-align:left\">aerodyne research inc</td></tr><tr><td style=\"text-align:left\">3-dimensional</td><td style=\"text-align:left\">synthecon, inc.</td></tr></table>"
      ],
      "text/plain": [
       " entity        | company                   \n",
       "---------------|---------------------------\n",
       " 3-dimensional | reactive innovations, llc \n",
       " 3-dimensional | aerodyne research inc     \n",
       " 3-dimensional | synthecon, inc.           "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#8. What companies are working in similar research areas in x (ex: AI)?\n",
    "#As GRAPH:\n",
    "cypher_FP_query8a = \"\"\"\n",
    "CALL {\n",
    "    MATCH (p:Principal)-[:RESEARCHED]->(sbir_abstract:Sbir_Abstract)-[:HOLDS]->(e:Entities)\n",
    "    WHERE EXISTS {\n",
    "        MATCH ()-[r:HOLDS|HOLDS_PT]->(e)\n",
    "        WITH e, count(r) as rel_cnt\n",
    "        WHERE rel_cnt > 1\n",
    "    }\n",
    "    RETURN e as entity, p as company\n",
    "    ORDER BY entity \n",
    "    UNION\n",
    "    MATCH (ap:Assignee_PT)<-[:ASSIGN_PT]-(title_pt:Title_PT)-[:HAS_PT]->(patent_abstract:Patent_Abstract)-[:HOLDS_PT]->(e:Entities)\n",
    "    WHERE EXISTS {\n",
    "        MATCH ()-[r:HOLDS|HOLDS_PT]->(e)\n",
    "        WITH e, count(r) as rel_cnt\n",
    "        WHERE rel_cnt > 1\n",
    "    }\n",
    "    RETURN e as entity, ap as company\n",
    "    ORDER BY entity \n",
    "}\n",
    "RETURN entity, company\n",
    "ORDER BY entity \n",
    "\"\"\"\n",
    "#graph.run(cypher_FP_query8a)\n",
    "\n",
    "\n",
    "#Just text:\n",
    "cypher_FP_query8b = \"\"\"\n",
    "CALL {\n",
    "    MATCH (p:Principal)-[:RESEARCHED]->(sbir_abstract:Sbir_Abstract)-[:HOLDS]->(e:Entities)\n",
    "    WHERE EXISTS {\n",
    "        MATCH ()-[r:HOLDS|HOLDS_PT]->(e)\n",
    "        WITH e, count(r) as rel_cnt\n",
    "        WHERE rel_cnt > 1\n",
    "    }\n",
    "    RETURN toLower(e.entities) as entity, toLower(p.company) as company\n",
    "    ORDER BY entity \n",
    "    UNION\n",
    "    MATCH (ap:Assignee_PT)<-[:ASSIGN_PT]-(title_pt:Title_PT)-[:HAS_PT]->(patent_abstract:Patent_Abstract)-[:HOLDS_PT]->(e:Entities)\n",
    "    WHERE EXISTS {\n",
    "        MATCH ()-[r:HOLDS|HOLDS_PT]->(e)\n",
    "        WITH e, count(r) as rel_cnt\n",
    "        WHERE rel_cnt > 1\n",
    "    }\n",
    "    RETURN toLower(e.entities) as entity, toLower(ap.orgname) as company\n",
    "    ORDER BY entity \n",
    "}\n",
    "RETURN entity, company\n",
    "ORDER BY entity\n",
    "\"\"\"\n",
    "graph.run(cypher_FP_query8b)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "546eab70-d2cd-4848-aa39-41ae2b8c97ff",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
